Ramp can't have multisegment Riser.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MultusegmentRampRiserError { get; }
  Visual Basic
Public Shared ReadOnly Property MultusegmentRampRiserError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MultusegmentRampRiserError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace